XKCANO/ceshi0223/KD001-0111/Library/src/fm33lf0xx_fl_fscan.c
 /**    
  *******************************************************************************************************
  * @file    fm33lf0xx_fl_fscan.c
  * @author  FMSH Application Team
  * @brief   Src file of FSCAN FL Module
  *******************************************************************************************************   
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33LF0xx   
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33lf0xx_fl.h"
/** @addtogroup FM33LF0XX_FL_Driver
  * @{
  */

/** @addtogroup FSCAN
  * @{
  */

#ifdef FL_FSCAN_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup FSCAN_FL_Private_Macros
  * @{
  */


#define     IS_FSCAN_INSTANCE(INSTANCE)                     (((INSTANCE) == FSCAN))
                                                         
#define     IS_FSCAN_SJW(__VALUE__)                        (((__VALUE__) == FL_FSCAN_SJW_1Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_SJW_2Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_SJW_3Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_SJW_4Tq))
                                                         
#define     IS_FSCAN_TS1(__VALUE__)                        (((__VALUE__) == FL_FSCAN_TS1_1Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_2Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_3Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_4Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_5Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_6Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_7Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_8Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_9Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_10Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_11Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_12Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_13Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_14Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_15Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS1_16Tq))
                                                         
#define     IS_FSCAN_TS2(__VALUE__)                        (((__VALUE__) == FL_FSCAN_TS2_1Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_2Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_3Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_4Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_5Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_6Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_7Tq) ||\
                                                          ((__VALUE__) == FL_FSCAN_TS2_8Tq)) 
            
#define    IS_FSCAN_TX_PRIORITY(__VALUE__)                 (((__VALUE__) == FL_FSCAN_TX_PRIORITY_ID) ||\
                                                          ((__VALUE__) == FL_FSCAN_TX_PRIORITY_BUFFER))
           
           
#define    IS_FSCAN_FILTER_EN(__VALUE__)                   (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_FSCAN_AFx(__VALUE__)                         (((__VALUE__) == FL_FSCAN_FILTER1) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER2) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER3) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER4) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER5) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER6) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER7) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER8) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER9) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER10) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER11) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER12) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER13) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER14) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER15) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTER16))
           
#define    IS_FSCAN_AFMRx(__VALUE__)                       (((__VALUE__) == FL_FSCAN_FILTERMASK1) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERMASK2) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERMASK3) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERMASK4))
           
#define    IS_FSCAN_AFIRx(__VALUE__)                       (((__VALUE__) == FL_FSCAN_FILTERID1) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERID2) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERID3) ||\
                                                          ((__VALUE__) == FL_FSCAN_FILTERID4))
                                                                                              
#define    IS_FSCAN_MODE(__VALUE__)                        (((__VALUE__) == FL_FSCAN_MODE_NORMAL)   ||\
                                                          ((__VALUE__) == FL_FSCAN_MODE_LOOPBACK) ||\
                                                          ((__VALUE__) == FL_FSCAN_MODE_CONFIG)   ||\
                                                          ((__VALUE__) == FL_FSCAN_MODE_SLEEP))
           
           
#define    IS_FSCAN_CLK(__VALUE__)                         (((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_RCHF) ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_XTHF) ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_PLL)  ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_APBCLK))
           
#define    IS_FSCAN_ABOM(__VALUE__)                        (((__VALUE__) == FL_FSCAN_AUTO_MANAGE_HARDWARE)      ||\
                                                          ((__VALUE__) == FL_FSCAN_AUTO_MANAGE_SOFTWARE_WAIT) ||\
                                                          ((__VALUE__) == FL_FSCAN_AUTO_MANAGE_SOFTWARE_INTERGRATION))
           
#define    IS_FSCAN_WAKEUP(__VALUE__)                      (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_FSCAN_SRR(__VALUE__)                         (((__VALUE__) == FL_FSCAN_SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_FSCAN_SRR_BIT_HIGH))
                                                                          
#define    IS_FSCAN_STD1SRR(__VALUE__)                     (((__VALUE__) == FL_FSCAN_STD1SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_FSCAN_STD1SRR_BIT_HIGH))
                                                                          
#define    IS_FSCAN_STD2SRR(__VALUE__)                     (((__VALUE__) == FL_FSCAN_STD2SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_FSCAN_STD2SRR_BIT_HIGH))
                                                                          
